# BendingDetailAngularDimensionTextPosition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailAngularDimensionTextPosition Property
ParameterTypeId Class See Also
---
"Angle Text Position"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailAngularDimensionTextPosition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailAngularDimensionTextPosition As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailAngularDimensionTextPosition {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace